# PAGE_NAME으로 바로 호출 가능하도록 0번째 값을 비워줌
testcase_and_result = [{
    'que_number': 0,
    'testcase': None,
    'result': None,
}, {
    'que_number': 1,
    'testcase': [['  + + - + -+-', '  ++--+-+  ', '++ -+ -+-', '+++- +-+'], ['++-- -++', '++-- --+', '+++- +--'], ['++-++--', '++-+--+', '++-++++', '++-+++-']],
    'result': ['jeju', 'cat', 'lion'],
}, {
    'que_number': 2,
    'testcase': ['adr10bb1d9ia10e33b7u88k3j1a3v11v9', 'r1rr2rrr3rrrrr4rrrrrre5', '12345r12345e90v90r90'],
    'result': ['2월 3일', '1월 5일', '2월 8일'],
}, {
    'que_number': 3,
    'testcase': [
        [['A', 25, 24, 11, 12], ['B', 13, 22, 16, 14], ['C', 12, 22, 16, 14], ['D', 13, 22, 16, 14], ['E', 12, 25, 16, 19], ['F', 23, 15, 16, 14], ['G', 13, 14, 3, 5], ['H', 25, 22, 11, 14], ['I', 13, 12, 14, 23], ['J', 13, 22, 15, 14]],
        [['A', 11, 23, 17, 15], ['B', 15, 22, 17, 22], ['C', 13, 22, 16, 14], ['D', 18, 22, 16, 25], ['E', 8, 13, 23, 21]],
        [['A', 25, 25, 25, 25], ['B', 25, 25, 25, 25], ['C', 25, 25, 25, 25], ['J', 13, 22, 16, 14]],
    ],
    'result': [['H', 'E', 'A'], ['D'], []],
}, {
    'que_number': 4,
    'testcase': [['10 - A. 20 - B. 30 - A.', '1 - A. 1 - A. 1 - A. 1 - A. 2 - B. 1 - A. 1 - B'], ['10 a. 10 a. 10 a. 20 b. 30 c.', 'c -- 100, c -- 100, c -- 100'], ['100만큼 a를 훈련. 200만큼 b를 훈련. 300만큼 c를 훈련. ', '100만큼 d를 훈련, 200만큼 e를 훈련']],
    'result': ['최종 꿈의 설계는 원래 미래 260, 바뀐 미래 14760입니다. 이 수치대로 Vision을 만듭니다.', '최종 꿈의 설계는 원래 미래 9000, 바뀐 미래 52000입니다. 이 수치대로 Vision을 만듭니다.', '미래가 보이지 않습니다.'],
}, {
    'que_number': 5,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 6,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 7,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 8,
    'testcase': [ 100, 36000, 66600 ],
	'result': [ 0, 12, 24 ]
}, {
    'que_number': 9,
    'testcase': [[58000, 58700, 55300, 54200, 53600, 52700, 57700, 61100], [80000, 58000, 52700, 57700, 61100], [100, 2000, 30000, 400000]],
    'result': [6000, 27300, 0]
}, {
    'que_number': 10,
    'testcase': [[0, ""], [2, "연어"], [3, ""]],
    'result': ["기본 포케가 제공됩니다.", [["연어", "참치"], ["연어", "닭가슴살"], ["연어", "베이컨"], ["연어", "버섯"]],
    [["연어", "참치", "닭가슴살"], ["연어", "참치", "베이컨"], ["연어", "참치", "버섯"], ["연어", "닭가슴살", "베이컨"], ["연어", "닭가슴살", "버섯"], ["연어", "베이컨", "버섯"], ["참치", "닭가슴살", "베이컨"], ["참치", "닭가슴살", "버섯"], ["닭고기", "베이컨", "버섯"]]
    ],
}, {
    'que_number': 11,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 12,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 13,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 14,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 15,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 16,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 17,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 18,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 19,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}, {
    'que_number': 20,
    'testcase': [[10, 20], [30, 40], [50, 60]],
    'result': [30, 70, 110],
}]